{"weightsManifest": [{"weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_preds/kernel", "shape": [1, 1, 1024, 1000], "dtype": "float32"}, {"name": "conv_preds/bias", "shape": [1000], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_4_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv_pw_6_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_variance", "shape": [512], "dtype": "float32"}], "paths": ["group1-shard1of5", "group1-shard2of5", "group1-shard3of5", "group1-shard4of5", "group1-shard5of5"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["reshape_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "mobilenet_1.00_224", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}}, {"class_name": "ZeroPadding2D", "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv1_pad", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv1", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 32}}, {"class_name": "BatchNormalization", "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"name": "conv1_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_1", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_1", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"name": "conv_dw_1_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_1", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}}, {"class_name": "BatchNormalization", "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"name": "conv_pw_1_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_2", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_2", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"name": "conv_dw_2_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_2", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}}, {"class_name": "BatchNormalization", "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"name": "conv_pw_2_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_3", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_3", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"name": "conv_dw_3_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_3", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}}, {"class_name": "BatchNormalization", "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"name": "conv_pw_3_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_4", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_4", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"name": "conv_dw_4_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_4", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256}}, {"class_name": "BatchNormalization", "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"name": "conv_pw_4_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_5", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_5", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"name": "conv_dw_5_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_5", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256}}, {"class_name": "BatchNormalization", "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"name": "conv_pw_5_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_6", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_6", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"name": "conv_dw_6_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_6", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"name": "conv_pw_6_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_7", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_7", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"name": "conv_dw_7_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_7", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"name": "conv_pw_7_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_8", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_8", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"name": "conv_dw_8_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_8", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"name": "conv_pw_8_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_9", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_9", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"name": "conv_dw_9_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_9", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"name": "conv_pw_9_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_10", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_10", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"name": "conv_dw_10_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_10", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"name": "conv_pw_10_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_11", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_11", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"name": "conv_dw_11_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_11", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 512}}, {"class_name": "BatchNormalization", "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"name": "conv_pw_11_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "ZeroPadding2D", "name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "conv_pad_12", "padding": [[1, 1], [1, 1]]}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"activity_regularizer": null, "name": "conv_dw_12", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"name": "conv_dw_12_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv_pw_12", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 1024}}, {"class_name": "BatchNormalization", "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"name": "conv_pw_12_bn", "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "trainable": true, "activation": "relu6"}}, 